# Part 1 - setting up dependancies

In [1]:
import duckdb as db
import pandas as p
import sqlalchemy

# Part 2 - Creating the table

In [2]:
#creating the food table and then displaying it
db.sql('CREATE TABLE food as SELECT * FROM "Online_food_Kaggle.csv"')

In [3]:
db.sql('SHOW ALL TABLES')

┌──────────┬─────────┬─────────┬──────────────────────┬────────────────────────────────────────────────────┬───────────┐
│ database │ schema  │  name   │     column_names     │                    column_types                    │ temporary │
│ varchar  │ varchar │ varchar │      varchar[]       │                     varchar[]                      │  boolean  │
├──────────┼─────────┼─────────┼──────────────────────┼────────────────────────────────────────────────────┼───────────┤
│ memory   │ main    │ food    │ [Age, Gender, Mari…  │ [BIGINT, VARCHAR, VARCHAR, VARCHAR, VARCHAR, VAR…  │ false     │
└──────────┴─────────┴─────────┴──────────────────────┴────────────────────────────────────────────────────┴───────────┘

# Part 3 - Queries using SQL Statements

In [4]:
queryLargestDepartureDeLayFlights = '''
SELECT 
    Age
FROM 
    food
'''
print("Table generated with Carrier, CarrierName and DepartureDelaySum ")
result = db.sql(queryLargestDepartureDeLayFlights).fetchdf() #converted to dataframe
print("This is the dataframe:")
print(result)

Table generated with Carrier, CarrierName and DepartureDelaySum
This is the dataframe:
     Age
0     20
1     24
2     22
3     22
4     22
..   ...
383   23
384   23
385   22
386   23
387   23

[388 rows x 1 columns]

In [5]:
sql_query = """
    SELECT
        Gender,
        COUNT(*) AS total
    FROM 
        food
    GROUP BY Gender
"""

result = db.sql(sql_query).fetchdf()
print("This is the result:")
print(result)

This is the result:
   Gender  total
0  Female    166
1    Male    222

In [6]:
sql_query3 = """
SELECT
    "Educational Qualifications",
    AVG("Family size") AS Avg_Family_Size
FROM 
    food
GROUP BY "Educational Qualifications"
ORDER BY Avg_Family_Size DESC
"""


result = db.sql(sql_query3).fetchdf()
print("This is the result:")
print(result)

This is the result:
  Educational Qualifications  Avg_Family_Size
0                     School         4.416667
1                       Ph.D         3.695652
2                 Uneducated         3.500000
3                   Graduate         3.276836
4              Post Graduate         3.149425

In [7]:
sql_query4 = """
SELECT
    Gender,
    Feedback,
    COUNT(*) AS Total_Count
FROM 
    food
GROUP BY Gender, Feedback
"""
result = db.sql(sql_query4).fetchdf()
print("This is the result:")
print(result)

This is the result:
   Gender   Feedback  Total_Count
0  Female   Positive          139
1    Male   Positive          178
2    Male  Negative            44
3  Female  Negative            27

In [8]:
# Query 4
sql_query4 = """
SELECT
    Occupation,
    COUNT(*) AS Total_Count
FROM 
    food
GROUP BY Occupation
ORDER BY Total_Count DESC
"""

result = db.sql(sql_query4).fetchdf()
print("This is the result:")
print(result)

This is the result:
       Occupation  Total_Count
0         Student          207
1        Employee          118
2  Self Employeed           54
3      House wife            9

In [9]:
# Query 6
sql_query6 = """
SELECT
    Occupation,
    COUNT(*) AS Total_Count
FROM 
    food
WHERE Gender = 'Female'
GROUP BY Occupation
ORDER BY Total_Count DESC
LIMIT 1
"""

result = db.sql(sql_query6).fetchdf()
print("This is the result:")
print(result)

This is the result:
  Occupation  Total_Count
0    Student           92

# Part 4 - Using a text file to store all the SQL statements and then, running all of them.

In [14]:
# Open the text file containing SQL statements
with open("queries.txt", "r") as file:
    # Read all lines from the file
    lines = file.readlines()

    # Initialize an empty list to store SQL statements
    sql_queries = []

    # Iterate through each line in the file
    for line in lines:
        # Strip any leading or trailing whitespace
        line = line.strip()
        
        # Append non-empty lines (SQL statements) to the list
        if line:
            sql_queries.append(line)

# Now, you have all SQL statements in the 'sql_queries' list
# You can execute each SQL statement using a for loop
for sql_query in sql_queries:
    # Execute the SQL query
    result = db.sql(sql_query).fetchdf()
    
    # Print the result
    print("Result for query:")
    print(result)
    print("\n")

Result for query:
       Occupation  Average_Age
0        Employee    26.576271
1         Student    22.811594
2      House wife    30.333333
3  Self Employeed    26.388889


Result for query:
  Educational Qualifications  Avg_Family_Size
0                     School         4.416667
1                       Ph.D         3.695652
2                 Uneducated         3.500000
3                   Graduate         3.276836
4              Post Graduate         3.149425


Result for query:
       Occupation  Total_Count
0         Student          207
1        Employee          118
2  Self Employeed           54
3      House wife            9


Result for query:
  Occupation  Total_Count
0    Student           92